# Complete Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinition..::..Complete Property
RebarShapeDefinition Class See Also
---
Report whether the shape definition is fully constrained.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public bool Complete { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Complete As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Complete {
	bool get ();
}
```

# See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace